Tekla Open API Reference for Tekla Structures 2025
SymbolInfo Class
 The SymbolInfo class holds symbol information: the symbol file and the symbol index in the symbol file.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.SymbolInfo
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SymbolInfo : IIsEqual
<SerializableAttribute>
Public NotInheritable Class SymbolInfo
	Implements IIsEqual
The SymbolInfo type exposes the following members.
Constructors
Name | Description
SymbolInfo()
 Creates a new symbol info instance.
SymbolInfo(String, Int32)
 Creates a new symbol info instance.
Top
Properties
Name | Description
SymbolFile
 Gets or sets the symbol file. E.g. "xsteel".
SymbolIndex
 Gets or sets the the symbol index. Throws an ArgumentOutOfRangeException if the symbol index is not in the range from 0 to 255.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
Top
Fields
Name | Description
Default
 The default symbol information: the symbol 0 in the xsteel library.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace